{
  "publications": [
    {
      "authors": "<strong><u>H. Kim</u></strong>, J. Ryu, S. Son, J. Jeong, H. Kim, &  J. Yoon.",
      "title": "A spectral test of the butterfly effect and physical consistency in the diffusion-based GenCast's ensembles",
      "link": "",
      "status": "(Under review at npj Climate and Atmospheric Science)"
    },
    {
      "authors": "J. Ryu, <strong><u>H. Kim</u></strong>, S. Wang, J. Yoon.",
      "title": "Increasing Resolution and Accuracy in Sub-Seasonal Forecasting through 3D U-Net: the Western US",
      "link": "https://egusphere.copernicus.org/preprints/2025/egusphere-2025-308/",
      "status": "(Accepted for publication at Geoscientific Model Development)"
    }
    // {
    //   "title": "Will be updated soon...!"
    // }
  ],
  "conferences": [
    {
      "conferences": "AGU25 Meeting",
      "type": "Oral presentation",
      "authors": "<strong><u>H. Kim</u></strong> &  J. Yoon.",
      "title": "Revealing the butterfly effect in deep learning weather prediction model via kinetic energy spectra change",
      "location": "New Orleans, LA, USA"
    }
  ],
  "experience": [
    {
      "lab": "Climate Analysis and Modeling Lab, GIST",
      "period": "Feb. 2023 – Aug. 2025",
      "position": "Undergraduate Research Intern under Prof. Jin-ho Yoon",
      "details": [
        "Explored perturbations in GraphCast to examine error cascades and the butterfly effect.",
        "Investigated the potential use of physics-aligned perturbations to enhance deep learning-based weather forecasting.",
        "Analyzed the relationship between SO₂, NOₓ pollution and Yongsan River water quality using ECMWF data."
      ]
    },
    {
      "lab": "Computer Emergency Response Team (CERT), Republic of Korea Naval Fleet Command",
      "period": "Feb. 2021 – Oct. 2022",
      "position": "Information Security Controller",
      "details": [
        "Distributed batch files to edit registry through NAC (Network Access Control) program and removed vulnerable files in servers and users’ computers to prevent \"MS-MSDT\" and \"log4j\" vulnerabilities that allow unauthorized remote access to the Linux server",
        "Analyzed packets and logs of cybersecurity equipment such as firewall and IPS (Intrusion Prevention System), found unidentified or unnecessary communication"
      ]
    }
  ]
} 